<a href="https://colab.research.google.com/github/zainali60/machine-learning-with-python-practice/blob/main/chap_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [25]:
url = "https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv"
# Load data as a dataframe
dff = pd.read_csv(url, sep='\t')
# Show first 5 rows
dff.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [26]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

In [27]:
df = pd.DataFrame()
# Add columns
df['Name'] = ['Jacky Jackson', 'Steven Stevenson']
df['Age'] = [38, 25]
df['Driver'] = [True, False]

In [28]:
df

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [17]:
# Create row
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])
# Append row
df.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [15]:
df

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [18]:
df.describe()

             Age
count   2.000000
mean   31.500000
std     9.192388
min    25.000000
25%    28.250000
50%    31.500000
75%    34.750000
max    38.000000

In [30]:
dff.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [32]:
dff.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [34]:
# Select three rows
dff.iloc[1:4]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S

[3 rows x 12 columns]

In [38]:
# Set index
dataframe = dff.set_index(dff['Name'])
dataframe.head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Allen, Mr. William Henry                                      5  ...         S

[5 rows x 12 columns]

In [43]:
# show row
dataframe.loc['Heikkinen, Miss. Laina':'Allen, Mr. William Henry']

                                              PassengerId  ...  Embarked
Name                                                       ...
Heikkinen, Miss. Laina                                  3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)            4  ...         S
Allen, Mr. William Henry                                5  ...         S

[3 rows x 12 columns]

In [44]:
# Show top two rows where column 'sex' is 'female'
dataframe[dataframe['Sex'] == 'female'].head(2)

                                                    PassengerId  ...  Embarked
Name                                                             ...
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S

[2 rows x 12 columns]

In [46]:
# Filter rows
dataframe[(dataframe['Sex'] == 'female') & (dataframe["Age"] > 26.0)] .head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)             9  ...         S
Bonnell, Miss. Elizabeth                                     12  ...         S
Hewlett, Mrs. (Mary D Kingcome)                              16  ...         S

[5 rows x 12 columns]

In [47]:
# Replace values, show two rows
#dataframe['Sex'].replace("female", "Woman").head(2)

# Replace "female" and "male with "Woman" and "Man"
dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

Name
Braund, Mr. Owen Harris                                  Man
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Woman
Heikkinen, Miss. Laina                                 Woman
Futrelle, Mrs. Jacques Heath (Lily May Peel)           Woman
Allen, Mr. William Henry                                 Man
Name: Sex, dtype: object

In [48]:
dataframe.head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Allen, Mr. William Henry                                      5  ...         S

[5 rows x 12 columns]

In [49]:
# Replace values, show two rows
dataframe.replace(r"1", "One", regex=True).head(2)

# not working

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C

[2 rows x 12 columns]

In [50]:
# Replace values, show two rows
dataframe.replace(1, "One").head(2)

                                                   PassengerId  ... Embarked
Name                                                            ...
Braund, Mr. Owen Harris                                    One  ...        S
Cumings, Mrs. John Bradley (Florence Briggs Tha...           2  ...        C

[2 rows x 12 columns]

In [51]:
# Rename columns, show two rows
dataframe.rename(columns={'Sex': 'Gender'}).head(2)

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C

[2 rows x 12 columns]

In [52]:
import collections

In [53]:
column_names = collections.defaultdict(str)
# Create keys
for name in dataframe.columns:
 column_names[name]
# Show dictionary
column_names

defaultdict(str,
            {'Age': '',
             'Cabin': '',
             'Embarked': '',
             'Fare': '',
             'Name': '',
             'Parch': '',
             'PassengerId': '',
             'Pclass': '',
             'Sex': '',
             'SibSp': '',
             'Survived': '',
             'Ticket': ''})

In [59]:
# Calculate statistics
print('Maximum:', dataframe['Age'].max())
print("Minimum:", dataframe["Age"].min())
print("Minimum:", dataframe["Age"].count())
print("Minimum:", dataframe["Age"].sum())
print("Minimum:", dataframe["Age"].std())
print("Minimum:", dataframe["Age"].mean())

Maximum: 71.0
Minimum: 0.83
Minimum: 126
Minimum: 3545.83
Minimum: 14.613879926560795
Minimum: 28.141507936507935

In [60]:
# show conts
dataframe.count()

PassengerId    156
Survived       156
Pclass         156
Name           156
Sex            156
Age            126
SibSp          156
Parch          156
Ticket         156
Fare           156
Cabin           31
Embarked       155
dtype: int64

In [61]:
# show unique value
dataframe["Sex"].unique()

array(['male', 'female'], dtype=object)

In [66]:
dataframe["Sex"].value_counts()

male      100
female     56
Name: Sex, dtype: int64

In [67]:
## Select missing values, show two rows
dataframe[dataframe['Age'].isnull()].head(2)

                              PassengerId  Survived  ...  Cabin Embarked
Name                                                 ...
Moran, Mr. James                        6         0  ...    NaN        Q
Williams, Mr. Charles Eugene           18         1  ...    NaN        S

[2 rows x 12 columns]

In [72]:
np.where(dataframe['Age'].isnull())

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154]),)

In [75]:
# Replace values with NaN
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)
dataframe.head()

                                                    PassengerId  ...  Embarked
Name                                                             ...
Braund, Mr. Owen Harris                                       1  ...         S
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2  ...         C
Heikkinen, Miss. Laina                                        3  ...         S
Futrelle, Mrs. Jacques Heath (Lily May Peel)                  4  ...         S
Allen, Mr. William Henry                                      5  ...         S

[5 rows x 12 columns]

In [82]:
# Load data, set missing values
df1 = pd.read_csv(url, na_values=[np.nan, 'NONE', -999], sep='\t')

In [83]:
df1

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[156 rows x 12 columns]

In [84]:
dataframe.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [85]:
# Delete column
dataframe.drop('Parch', axis=1).head(2)
# second method
   # dataframe.drop(dataframe.columns[1], axis=1).head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 11 columns]

In [86]:
# Delete rows, show first two rows of output
dataframe[dataframe['Sex'] != 'male'].head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[2 rows x 12 columns]

In [87]:
# Delete row, show first two rows of output
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

In [ ]:
# Delete row, show first two rows of output
dataframe[dataframe.index != 0].head(2)

In [88]:
# Drop duplicates, show first two rows of output
dataframe.drop_duplicates().head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [89]:
# Show number of rows
print("Number Of Rows In The Original DataFrame:", len(dataframe))
print("Number Of Rows After Deduping:", len(dataframe.drop_duplicates()))

Number Of Rows In The Original DataFrame: 156
Number Of Rows After Deduping: 156

In [90]:
dataframe.groupby('Sex').mean()

        PassengerId  Survived    Pclass        Age  SibSp     Parch       Fare
Sex
female       68.125  0.714286  2.464286  24.468085  0.875  0.517857  28.460639
male         84.310  0.140000  2.400000  30.326962  0.470  0.330000  27.912998

In [91]:
# Group rows, count rows
dataframe.groupby('Parch')['Name'].count()

Parch
0    121
1     15
2     17
3      1
5      2
Name: Name, dtype: int64

In [93]:
  # Group rows, calculate mean
dataframe.groupby(['Sex','SibSp'])['Age'].mean()

Sex     SibSp
female  0        27.500000
        1        25.075000
        2        13.500000
        3        21.333333
        4         9.500000
        5        16.000000
male    0        32.969636
        1        30.233333
        2        28.000000
        3         8.333333
        4         4.500000
        5        11.000000
Name: Age, dtype: float64

In [92]:
dataframe.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [94]:
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
time_index

DatetimeIndex(['2017-06-06 00:00:00', '2017-06-06 00:00:30',
               '2017-06-06 00:01:00', '2017-06-06 00:01:30',
               '2017-06-06 00:02:00', '2017-06-06 00:02:30',
               '2017-06-06 00:03:00', '2017-06-06 00:03:30',
               '2017-06-06 00:04:00', '2017-06-06 00:04:30',
               ...
               '2017-07-10 17:15:00', '2017-07-10 17:15:30',
               '2017-07-10 17:16:00', '2017-07-10 17:16:30',
               '2017-07-10 17:17:00', '2017-07-10 17:17:30',
               '2017-07-10 17:18:00', '2017-07-10 17:18:30',
               '2017-07-10 17:19:00', '2017-07-10 17:19:30'],
              dtype='datetime64[ns]', length=100000, freq='30S')

In [96]:
# Create DataFrame
dataframe1 = pd.DataFrame(index=time_index)
dataframe1.head()

Empty DataFrame
Columns: []
Index: [2017-06-06 00:00:00, 2017-06-06 00:00:30, 2017-06-06 00:01:00, 2017-06-06 00:01:30, 2017-06-06 00:02:00]

In [99]:
# Create column of random values
dataframe1['Sale_Amount'] = np.random.randint(1, 10, 100000)
dataframe1.head()

                     Sale_Amount
2017-06-06 00:00:00            3
2017-06-06 00:00:30            6
2017-06-06 00:01:00            2
2017-06-06 00:01:30            6
2017-06-06 00:02:00            7

In [102]:
# Group rows by week, calculate sum per week
dataframe1.resample('W').sum().head()

            Sale_Amount
2017-06-11        86453
2017-06-18       100693
2017-06-25       100865
2017-07-02       101396
2017-07-09       100637

In [101]:
dataframe1.head(3)

                     Sale_Amount
2017-06-06 00:00:00            3
2017-06-06 00:00:30            6
2017-06-06 00:01:00            2

In [103]:
# Show first two names uppercased
[name.upper() for name in dataframe['Name'][0:2]]

['BRAUND, MR. OWEN HARRIS',
 'CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)']

In [105]:
# Create function
def uppercase(x):
 return x.upper()
# Apply function, show two rows
dataframe['Name'].apply(uppercase)[0:5]

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                               HEIKKINEN, MISS. LAINA
3         FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                             ALLEN, MR. WILLIAM HENRY
Name: Name, dtype: object

In [106]:
# Group rows, apply function to groups
dataframe.groupby('Sex').apply(lambda x: x.count())

        PassengerId  Survived  Pclass  Name  ...  Ticket  Fare  Cabin  Embarked
Sex                                          ...
female           56        56      56    56  ...      56    56     13        55
male            100       100     100   100  ...     100   100     18       100

[2 rows x 12 columns]